In [1]:
import os
os.getcwd()

'C:\\Users\\HP'

In [2]:
os.chdir('C:\\Users\\HP\\Desktop\\letsupgrade_python\\Predict future sales')
os.getcwd()

'C:\\Users\\HP\\Desktop\\letsupgrade_python\\Predict future sales'

In [3]:
# Importing liabraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
from pandas import datetime

<ipython-input-3-264d0b5b2613>:7: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  from pandas import datetime

In [4]:
#import warnings
import warnings
warnings.filterwarnings('ignore')

In [5]:
df_train = pd.read_csv("sales_train.csv")
df_train.head()

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0

In [6]:
df_test = pd.read_csv("test.csv")
df_test.head()

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268

In [7]:
df_shops = pd.read_csv("shops.csv")
df_shops.head()

                        shop_name  shop_id
0   !Якутск Орджоникидзе, 56 фран        0
1   !Якутск ТЦ "Центральный" фран        1
2                Адыгея ТЦ "Мега"        2
3  Балашиха ТРК "Октябрь-Киномир"        3
4        Волжский ТЦ "Волга Молл"        4

In [8]:
df_items_categories = pd.read_csv("item_categories.csv")
df_items_categories.head()

        item_category_name  item_category_id
0  PC - Гарнитуры/Наушники                 0
1         Аксессуары - PS2                 1
2         Аксессуары - PS3                 2
3         Аксессуары - PS4                 3
4         Аксессуары - PSP                 4

In [9]:
df_items = pd.read_csv("items.csv")
df_items.head()

,item_name,item_id,item_category_id
0,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,0,40
1,!ABBYY FineReader 12 Professional Edition Full...,1,76
2,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40
3,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40
4,***КОРОБКА (СТЕКЛО) D,4,40

# Checking missing values of train data

In [10]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2935849 entries, 0 to 2935848
Data columns (total 6 columns):
 #   Column          Dtype
---  ------          -----
 0   date            object
 1   date_block_num  int64
 2   shop_id         int64
 3   item_id         int64
 4   item_price      float64
 5   item_cnt_day    float64
dtypes: float64(2), int64(3), object(1)
memory usage: 134.4+ MB

In [11]:
df_train.shape

(2935849, 6)

In [12]:
df_train.isnull().sum

<bound method DataFrame.sum of           date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0        False           False    False    False       False         False
1        False           False    False    False       False         False
2        False           False    False    False       False         False
3        False           False    False    False       False         False
4        False           False    False    False       False         False
...        ...             ...      ...      ...         ...           ...
2935844  False           False    False    False       False         False
2935845  False           False    False    False       False         False
2935846  False           False    False    False       False         False
2935847  False           False    False    False       False         False
2935848  False           False    False    False       False         False

[2935849 rows x 6 columns]>

# Checking missing values of test data

In [13]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214200 entries, 0 to 214199
Data columns (total 3 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   ID       214200 non-null  int64
 1   shop_id  214200 non-null  int64
 2   item_id  214200 non-null  int64
dtypes: int64(3)
memory usage: 4.9 MB

In [14]:
df_test.shape

(214200, 3)

In [15]:
df_test.isnull().sum

<bound method DataFrame.sum of            ID  shop_id  item_id
0       False    False    False
1       False    False    False
2       False    False    False
3       False    False    False
4       False    False    False
...       ...      ...      ...
214195  False    False    False
214196  False    False    False
214197  False    False    False
214198  False    False    False
214199  False    False    False

[214200 rows x 3 columns]>

# Checking missing values of shops data

In [16]:
df_shops.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   shop_name  60 non-null     object
 1   shop_id    60 non-null     int64
dtypes: int64(1), object(1)
memory usage: 1.1+ KB

In [17]:
df_shops.shape

(60, 2)

In [18]:
df_shops.isnull().sum

<bound method DataFrame.sum of     shop_name  shop_id
0       False    False
1       False    False
2       False    False
3       False    False
4       False    False
5       False    False
6       False    False
7       False    False
8       False    False
9       False    False
10      False    False
11      False    False
12      False    False
13      False    False
14      False    False
15      False    False
16      False    False
17      False    False
18      False    False
19      False    False
20      False    False
21      False    False
22      False    False
23      False    False
24      False    False
25      False    False
26      False    False
27      False    False
28      False    False
29      False    False
30      False    False
31      False    False
32      False    False
33      False    False
34      False    False
35      False    False
36      False    False
37      False    False
38      False    False
39      False    False
40      False    False
41      False    False
42      False    False
43      False    False
44      False    False
45      False    False
46      False    False
47      False    False
48      False    False
49      False    False
50      False    False
51      False    False
52      False    False
53      False    False
54      False    False
55      False    False
56      False    False
57      False    False
58      False    False
59      False    False>

# Checking missing values of items (categories)

In [19]:
df_items_categories.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84 entries, 0 to 83
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   item_category_name  84 non-null     object
 1   item_category_id    84 non-null     int64
dtypes: int64(1), object(1)
memory usage: 1.4+ KB

In [20]:
df_items_categories.shape

(84, 2)

In [21]:
df_items_categories.isnull().sum()

item_category_name    0
item_category_id      0
dtype: int64

# Checking missing values of items

In [22]:
df_items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22170 entries, 0 to 22169
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   item_name         22170 non-null  object
 1   item_id           22170 non-null  int64
 2   item_category_id  22170 non-null  int64
dtypes: int64(2), object(1)
memory usage: 519.7+ KB

In [23]:
df_items.shape

(22170, 3)

In [24]:
df_items.isnull().sum

<bound method DataFrame.sum of        item_name  item_id  item_category_id
0          False    False             False
1          False    False             False
2          False    False             False
3          False    False             False
4          False    False             False
...          ...      ...               ...
22165      False    False             False
22166      False    False             False
22167      False    False             False
22168      False    False             False
22169      False    False             False

[22170 rows x 3 columns]>

# There is no null values present in any data

# EDA PART

In [25]:
from datetime import datetime

df_train['date'] = pd.to_datetime(df_train['date'], dayfirst=True)
df_train['date'] = df_train['date'].apply(lambda x: x.strftime('%Y-%m'))
df_train.head()

      date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  2013-01               0       59    22154      999.00           1.0
1  2013-01               0       25     2552      899.00           1.0
2  2013-01               0       25     2552      899.00          -1.0
3  2013-01               0       25     2554     1709.05           1.0
4  2013-01               0       25     2555     1099.00           1.0

In [26]:
df_train.head().sort_values(by = 'date')

      date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  2013-01               0       59    22154      999.00           1.0
1  2013-01               0       25     2552      899.00           1.0
2  2013-01               0       25     2552      899.00          -1.0
3  2013-01               0       25     2554     1709.05           1.0
4  2013-01               0       25     2555     1099.00           1.0

In [27]:
df_train.drop(['date_block_num','item_price'], axis=1, inplace=True)

In [28]:
df = df_train.groupby(['date','shop_id','item_id']).sum()
df

                         item_cnt_day
date    shop_id item_id
2013-01 0       32                6.0
                33                3.0
                35                1.0
                43                1.0
                51                2.0
...                               ...
2015-10 59      22087             6.0
                22088             2.0
                22091             1.0
                22100             1.0
                22102             1.0

[1609124 rows x 1 columns]

In [29]:
df = df.pivot_table(index=['shop_id','item_id'], columns='date', values='item_cnt_day', fill_value=0)

In [30]:
df.reset_index(inplace=True)
df.head()

date,shop_id,item_id,2013-01,2013-02,2013-03,2013-04,2013-05,2013-06,2013-07,2013-08,...,2015-01,2015-02,2015-03,2015-04,2015-05,2015-06,2015-07,2015-08,2015-09,2015-10
0,0,30,0,31,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,31,0,11,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,32,6,10,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,33,3,3,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,35,1,14,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [31]:
df_test = pd.merge(df_test, df, on=['shop_id','item_id'], how='left')

In [32]:
df_test.drop(['ID', '2013-01'], axis=1, inplace=True)
df_test = df_test.fillna(0)
df_test.head()

,shop_id,item_id,2013-02,2013-03,2013-04,2013-05,2013-06,2013-07,2013-08,2013-09,...,2015-01,2015-02,2015-03,2015-04,2015-05,2015-06,2015-07,2015-08,2015-09,2015-10
0,5,5037,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,2.0,0.0,0.0,0.0,1.0,1.0,1.0,3.0,1.0,0.0
1,5,5320,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,5,5233,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,3.0,2.0,0.0,1.0,3.0,1.0
3,5,5232,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
4,5,5268,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [33]:
Y_train = df['2015-10'].values
X_train = df.drop(['2015-10'], axis = 1)
X_test = df_test

print(X_train.shape, Y_train.shape)
print(X_test.shape)

(424124, 35) (424124,)
(214200, 35)

In [34]:
from sklearn.preprocessing import StandardScaler
X_train = StandardScaler().fit(X_train).transform(X_train)
X_test = StandardScaler().fit(X_test).transform(X_test)

In [35]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split( X_train, Y_train, test_size=0.2, random_state=4)
print ('Train set:', x_train.shape,  y_train.shape)
print ('Test set:', x_test.shape,  y_test.shape)

Train set: (339299, 35) (339299,)
Test set: (84825, 35) (84825,)

In [36]:
##y_train = df['2015-10']

In [37]:
from sklearn.ensemble import RandomForestRegressor
rf_model = RandomForestRegressor(n_estimators = 100)

In [38]:
rf_model.fit(x_train,y_train)

RandomForestRegressor()

In [39]:
from sklearn.metrics import mean_squared_error
print('Train set mse:', mean_squared_error(y_train, rf_model.predict(x_train)))
print('Test set mse:', mean_squared_error(y_test, rf_model.predict(x_test)))
print('Test set score:', rf_model.score(x_train,y_train))

Train set mse: 1.5977090177100428
Test set mse: 1.0941966590038315
Test set score: 0.9182017914587013

In [51]:
rf_pred = rf_model.predict(X_test)

In [52]:
y_pred = rf_model.predict(X_test)
y_pred

array([0.34, 1.36, 0.78, ..., 0.05, 0.93, 0.  ])

In [54]:
df_submission = pd.read_csv("sample_submission.csv")
print(df_submission.shape)
df_submission.head()

(214200, 2)

   ID  item_cnt_month
0   0             0.5
1   1             0.5
2   2             0.5
3   3             0.5
4   4             0.5

In [55]:
df_submission['item_cnt_month'] = y_pred
df_submission.to_csv('y_pred.csv', index=False)
df_submission.head()

   ID  item_cnt_month
0   0            0.34
1   1            1.36
2   2            0.78
3   3            0.00
4   4            1.20